Revit 2027 API
MEPAnalyticalConnectionType.FindTypeByName Method
 Finds the analytical connection type by its name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId FindTypeByName(
	Document doc,
	string name
)
Public Shared Function FindTypeByName (
	doc As Document,
	name As String
) As ElementId
public:
static ElementId^ FindTypeByName(
	Document^ doc,
	String^ name
)
static member FindTypeByName :
        doc : Document *
        name : string -> ElementId
Parameters
doc Document
 The document where the analytical conneciton type is expected.
name String
 The name of the expected analytical connection type.
Return Value
ElementId
 The element id of matched analytical connection type, otherwise invalidElementId.
Exceptions
Exception | Condition
ArgumentException |  name is an empty string.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace